[Highway.FRANK_HW_01 SoundNodeWave]
Comment="Notes[Franklin of course assumes that the two Gears are Locust, since they're in Locust armor.], TRIGGER[They'll reach another area filled with numerous cells, and it'll trigger a cinematic. BEGIN CINEMATIC. Marcus and Dom, still in Theron armor, approach the cell of Franklin, a Stranded character from the first Gears of War. He doesn't recognize them at first, and understandably takes a pissed-off attitude.], GLOSSARY[stanky is an alternate form of stinky]"
SpokenText="What the hell you lookin' at, stanky? You're lucky I'm in this cage, bitch."
Subtitles[0]=(Text="What the hell you lookin' at, stanky? You're lucky I'm in this cage, bitch.")
bMature=False
bManualWordWrap=False

[Highway.FRANK_HW_02 SoundNodeWave]
Comment="Notes[], TRIGGER[], GLOSSARY[]"
SpokenText="Huh?"
Subtitles[0]=(Text="Huh?")
bMature=False
bManualWordWrap=False

[Highway.FRANK_HW_03 SoundNodeWave]
Comment="Notes[\"I never thought I'd be so happy to see your fascist asses!\" refers to a scene in Gears 1 in which Franklin calls the Gears fascists.], TRIGGER[Marcus and Dom reandando their helmets.], GLOSSARY[Holy shit in this case is a vulgar exclamation of wonder and happiness. \"Oh man, that's what I'm talkin' 'bout!\" is slang that merely expresses that Franklin is surprised and pleased. ]"
SpokenText="Holy shit! Oh man, that's what I'm talkin' 'bout! I never thought I'd be so happy to see your fascist asses!"
Subtitles[0]=(Text="Holy shit! Oh man, that's what I'm talkin' 'bout! I never thought I'd be so happy to see your fascist asses!")
bMature=True
bManualWordWrap=False

[Highway.FRANK_HW_04 SoundNodeWave]
Comment="Notes[Between lines, Franklin steps back.], TRIGGER[Dom opens the cage, Franklin spills out, gives him a hug, instinctively.], GLOSSARY[What's up, man, means what is going on, friend? Yo is a greeting. ]"
SpokenText="Hey, man, that's my boy Dom! What's up, man?! Yo, guess what?! I finally got some info on Maria, man, I think she might be—"
Subtitles[0]=(Text="Hey, man, that's my boy Dom! What's up, man?! Yo, guess what?! I finally got some info on Maria, man, I think she might be—")
bMature=False
bManualWordWrap=False

[Highway.FRANK_HW_05 SoundNodeWave]
Comment="Notes[], TRIGGER[], GLOSSARY[wanna means \"want to\"]"
SpokenText="Yo, Dom, man, you sure you don't wanna… ?"
Subtitles[0]=(Text="Yo, Dom, man, you sure you don't wanna… ?")
bMature=False
bManualWordWrap=False

[Highway.FRANK_HW_06 SoundNodeWave]
Comment="Notes[], TRIGGER[], GLOSSARY[\"I'm gettin' my ass outta here\" just means that Franklin intends to leave. \"Later, fools\" indicates a certain disgust but not contempt. \"Motherfuckers goin' deeper into the Hollow. Shit.\" underlines that Franklin thinks the Gears are crazy to do this.]"
SpokenText="Well, you must be crazy then, 'cause I'm gettin' my ass outta here. Later, fools… Motherfuckers goin' deeper into the Hollow. Shit."
Subtitles[0]=(Text="Well, you must be crazy then, 'cause I'm gettin' my ass outta here. Later, fools… Motherfuckers goin' deeper into the Hollow. Shit.")
bMature=True
bManualWordWrap=False

[Highway.FRANK_HW_03_Bleep SoundNodeWave]
bMature=False
bManualWordWrap=False
SpokenText="Holy…! Oh man, that's what I'm talkin' 'bout! I never thought I'd be so happy to see your fascist…!"
Subtitles[0]=(Text="Holy…! Oh man, that's what I'm talkin' 'bout! I never thought I'd be so happy to see your fascist…!")
Comment="Notes[\"I never thought I'd be so happy to see your fascist asses!\" refers to a scene in Gears 1 in which Franklin calls the Gears fascists. 7/18/2008: bleeped line], TRIGGER[Marcus and Dom reandando their helmets.], GLOSSARY[Holy shit in this case is a vulgar exclamation of wonder and happiness. \"Oh man, that's what I'm talkin' 'bout!\" is slang that merely expresses that Franklin is surprised and pleased. ]"

[Highway.FRANK_HW_06_Bleep SoundNodeWave]
bMature=False
bManualWordWrap=False
SpokenText="Well, you must be crazy then, 'cause I'm gettin' my… outta here. Later, fools… Mother… goin' deeper into the Hollow…."
Subtitles[0]=(Text="Well, you must be crazy then, 'cause I'm gettin' my… outta here. Later, fools… Mother… goin' deeper into the Hollow….")
Comment="Notes[7/18/2008: bleeped line], TRIGGER[], GLOSSARY[\"I'm gettin' my ass outta here\" just means that Franklin intends to leave. \"Later, fools\" indicates a certain disgust but not contempt. \"Motherfuckers goin' deeper into the Hollow. Shit.\" underlines that Franklin thinks the Gears are crazy to do this.]"

